#include "DS18B20.h"

/********************************************************
***********    函 数 名 ：Ds18b20Init    ****************
***********    功 能    ：DS18b20初始化  ****************
*********************************************************/
void Ds18b20Init()
{
	u8 i;
	DSPORT = 0;		 //总线拉低并延时480us~960us
	i = 70;	
	while(i--);
	DSPORT = 1;		 //拉高总线并等待DS18B20拉低总线  
	delay1ms(5);	 //即可初始化成功
}

/********************************************************
***********   函 数 名 ：Ds18b20Write           *********
***********   功 能    ：向DS18B20写入一个字节  *********
*********************************************************/
void Ds18b20Write(u8 dat)
{
	u16 i, j;
	for(j=0; j<8; j++)	
	{
		DSPORT = 0;	//总共写入8位数据，每次写入前先拉低总线     	 
		i++;
		DSPORT = dat & 0x01; //从最低位开始写入
		i=6;
		while(i--); 		  //每次写完一位延时60us
		DSPORT = 1;			  //然后释放总线
		dat >>= 1;
	}
}

/*********************************************************
*********** 函 数 名 ：Ds18b20ReadByte            ********
*********** 功 能    ：从DS18B20读取一个字节的数据 *******
**********************************************************/
u8 Ds18b20ReadByte()
{
	u8 byte, b;
	u16 i, j;	
	for(j=8; j>0; j--)	
	{
		DSPORT = 0;	  //总共读取8位数据，每次读取前先拉低总线
		i++;
		DSPORT = 1;	  //然后拉高总线
		i++;i++;	  //延时6us等待数据稳定

		b = DSPORT;	  //读取数据，最低位开始

		byte = (byte >> 1) | (b << 7);//将读取的一位数据并存放					  
	
		i = 4;	      //延时48us再读取下一位数 
		while(i--);
	}				
	return byte;
}

/**********************************************************
***********   函 数 名 ：Ds18b20Chang            **********
***********   功 能    ：让DS18B20开始转化数据   **********
**********************************************************/
void  Ds18b20Chang()
{
	Ds18b20Init();			//DS18B20初始化
	delay1ms(1);
	Ds18b20Write(0xcc);	//跳过ROM操作命令		 
	Ds18b20Write(0x44);	//温度转化命令   
}

/**********************************************************
***********   函 数 名 ：Ds18b20ReadTempCom   *************
***********   功 能    ：发送温度读取命令     *************
**********************************************************/
void  Ds18b20ReadTempCom()
{	

	Ds18b20Init();			//DS18B20初始化
	delay1ms(1);
	Ds18b20Write(0xcc);	//跳过ROM操作命令 
	Ds18b20Write(0xbe);	//读取温度命令 		
}											   

/**********************************************************
***********  函 数 名 ：Ds18b20ReadTemp      **************
***********  功 能    ：读取一个int类型的温度数据 *********
***********************************************************/
int Ds18b20ReadTemp()
{
	u16 temp = 0;
	u8 tmh, tml;
	Ds18b20Chang();		  //写入转化命令	 
	Ds18b20ReadTempCom();	  //等待转换完成读取数据		
	tml = Ds18b20ReadByte();  //温度值为16位	
	tmh = Ds18b20ReadByte();		
	temp = tmh;
	temp <<= 8;
	temp |= tml;
	return temp;
}

