#include "ESP8266.h"

u8 *mux="AT+CIPMUX=1\r\n";		        //AT指令多连接模式
u8 *server="AT+CIPSERVER=1,8080\r\n";   //AT指令设置8080端口

/********************************************************
***********    函 数 名 ：SendData         **************
***********    功 能    ：向ESP8266写入字符串  **********
*********************************************************/
void SendData(u8 *dat)  
{        
	while(*dat != '\0')
    {                
		SBUF = *dat;
        while(!TI);
        TI = 0;                   
        dat++;                                   
    }
	delay1ms(300);                                                                          
}

void SetPort()
{
	SendData(mux);
	SendData(server);
}
/********************************************************
***********    函 数 名 ：UartConfiguration    **********
***********    功 能    ：串口初始化           **********
*********************************************************/
void UartConfiguration()
{
    TMOD=0x20;      
	TH1=0xF3;		
	TL1=0xF3;		
	PCON=0x80;      
	SCON=0x50;	
	EA=1;		  
	ES=1;		
	TR1=1;			
}
/********************************************************
***********    函 数 名 ：ESP8266_init         **********
***********    功 能    ：ESP8266初始化        **********
*********************************************************/
void ESP8266_init()
{
	UartConfiguration();
	TI=0;          
	SetPort();
}
