#include "LCD1602.h"

/*******************************************************
***********   函 数 名 ：LcdWriteCom       *************
***********   功 能    ：写入一个字节命令  *************
********************************************************/
void LcdWriteCom(u8 com)	
{
	LCD1602_E = 0;             //使能
	LCD1602_RS = 0;	           //选择发送命令
	LCD1602_RW = 0;	           //选择写入
	
	LCD1602_DATAPINS = com;    //放入命令
	Lcd1602_Delay1ms(1);       //延时等待数据稳定¨

	LCD1602_E = 1;	           //写入时序
	Lcd1602_Delay1ms(5);	   //延时等待
	LCD1602_E = 0;
}

/*******************************************************
***********   函 数 名 ：LcdWriteData       ************
***********   功 能    ：写入一个字节数据   ************
********************************************************/
void LcdWriteData(u8 dat)		
{
	LCD1602_E = 0;	        //使能清零
	LCD1602_RS = 1;        	//选择输入数据
	LCD1602_RW = 0;     	//选择写入

	LCD1602_DATAPINS = dat; //写入数据
	Lcd1602_Delay1ms(1);	//延时

	LCD1602_E = 1;          //写入时序
	Lcd1602_Delay1ms(5);    //延时等待
	LCD1602_E = 0;
}

/*******************************************************
***********       函 数 名 ：LcdInit       *************
***********       功 能    ：LCD初始化     *************
********************************************************/
void LcdInit()						 
{
 	LcdWriteCom(0x38);  //开显示
	LcdWriteCom(0x0c);  //开显示不显示光标
	LcdWriteCom(0x06);  //写一个指针加一
	LcdWriteCom(0x01);  //清屏
	LcdWriteCom(0x80);  //设置数据指针起点
}

